app/views/students/index.html.slim

SELECT COUNT(*) FROM "subjects" INNER JOIN "students_subjects" ON "subjects"."id" = "students_subjects"."subject_id" WHERE "students_subjects"."student_id" = $1  [["student_id", 11]]
SELECT COUNT(*) FROM "teachers" INNER JOIN "subjects_teachers" ON "teachers"."id" = "subjects_teachers"."teacher_id" INNER JOIN "subjects" ON "subjects_teachers"."subject_id" = "subjects"."id" INNER JOIN "students_subjects" ON "subjects"."id" = "students_subjects"."subject_id" WHERE "students_subjects"."student_id" = $1  [["student_id", 11]]
---
          td
            = s.subjects.count
          td
            = s.teachers.count