app/views/students/show.html.slim

UPDATE "students" SET "roll_number" = $1, "city" = $2, "updated_at" = $3 WHERE "students"."id" = $4  [["roll_number", 122], ["city", "Delhi"], ["updated_at", "2019-06-01 13:12:01.939506"], ["id", 12]]
---
    = link_to "Delete Student", student_path(@student.id), method: "delete", class: "btn btn-danger delete-record"
    button.btn.btn-primary.delete-record type="button" data-toggle="modal" data-target="#edit-student"

SELECT "subjects"."name" FROM "subjects" INNER JOIN "students_subjects" ON "subjects"."id" = "students_subjects"."subject_id" WHERE "students_subjects"."student_id" = $1  [["student_id", 11]]
---
    | Subject(s) enrolled by #{@student.name}:
    = @student.subjects.pluck(:name).join(", ")

SELECT "teachers"."name" FROM "teachers" INNER JOIN "subjects_teachers" ON "teachers"."id" = "subjects_teachers"."teacher_id" INNER JOIN "subjects" ON "subjects_teachers"."subject_id" = "subjects"."id" INNER JOIN "students_subjects" ON "subjects"."id" = "students_subjects"."subject_id" WHERE "students_subjects"."student_id" = $1  [["student_id", 11]]
---
    | Teacher(s) for #{@student.name}:
    = @student.teachers.pluck(:name).join(", ")