app/views/subjects/index.html.slim

SELECT COUNT(*) FROM "teachers" INNER JOIN "subjects_teachers" ON "teachers"."id" = "subjects_teachers"."teacher_id" WHERE "subjects_teachers"."subject_id" = $1  [["subject_id", 1]]
SELECT COUNT(*) FROM "students" INNER JOIN "students_subjects" ON "students"."id" = "students_subjects"."student_id" WHERE "students_subjects"."subject_id" = $1  [["subject_id", 1]]
---
          td
            = s.teachers.count
          td
            = s.students.count