app/views/teachers/index.html.slim

          td
            = t.subjects.count
          td
            = t.students.count
---
SELECT COUNT(*) FROM "subjects" INNER JOIN "subjects_teachers" ON "subjects"."id" = "subjects_teachers"."subject_id" WHERE "subjects_teachers"."teacher_id" = $1  [["teacher_id", 1]]
SELECT COUNT(*) FROM "students" INNER JOIN "students_subjects" ON "students"."id" = "students_subjects"."student_id" INNER JOIN "subjects" ON "students_subjects"."subject_id" = "subjects"."id" INNER JOIN "subjects_teachers" ON "subjects"."id" = "subjects_teachers"."subject_id" WHERE "subjects_teachers"."teacher_id" = $1  [["teacher_id", 1]]