app/views/teachers/show.html.slim

    | Subject(s) taught by #{@teacher.name}:
    = @teacher.subjects.pluck(:name).join(", ")
---
SELECT "subjects"."name" FROM "subjects" INNER JOIN "subjects_teachers" ON "subjects"."id" = "subjects_teachers"."subject_id" WHERE "subjects_teachers"."teacher_id" = $1  [["teacher_id", 1]]

    | Student(s) under #{@teacher.name}:
    = @teacher.students.pluck(:name).join(", ")
---
SELECT "students"."name" FROM "students" INNER JOIN "students_subjects" ON "students"."id" = "students_subjects"."student_id" INNER JOIN "subjects" ON "students_subjects"."subject_id" = "subjects"."id" INNER JOIN "subjects_teachers" ON "subjects"."id" = "subjects_teachers"."subject_id" WHERE "subjects_teachers"."teacher_id" = $1  [["teacher_id", 1]]