app/controllers/home_controller.rb

  def show
    @student = Student.new
    @student_count = Student.count
    @teacher = Teacher.new
    @teacher_count = Teacher.count
    @subject_new = Subject.new
    @subject_count = Subject.count
    @subjects = Subject.all
---
SELECT COUNT(*) FROM "students"
SELECT COUNT(*) FROM "teachers"
SELECT COUNT(*) FROM "subjects"
SELECT "subjects".* FROM "subjects"