app/controllers/home_controller.rb

SELECT "subjects".* FROM "subjects"
---
  def index
    @student = Student.new
    @teacher = Teacher.new
    @subject = Subject.new
    @subjects = Subject.all