app/controllers/students_controller.rb

  def create
    student = Student.new(student_params)
    subject_ids = unsafe_params["student"]["subject_ids"]
    student.subjects = Subject.where(id: unsafe_params["student"]["subject_ids"])
    student.save
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" IN (NULL, 1, 2) LIMIT $1  [["LIMIT", 1]]
INSERT INTO "students" ("name", "roll_number", "city", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Rishi Rawat"], ["roll_number", 12], ["city", "PUNE"], ["created_at", "2019-06-01 06:08:13.472704"], ["updated_at", "2019-06-01 06:08:13.472704"]]

  def show
    @student = Student.find_by_id(params["id"])
    @subjects = Subject.all
---
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT "subjects".* FROM "subjects"

  def teachers_details
    @teachers_details = Student.find_by_id(params["id"]).teachers
---
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT "teachers".* FROM "teachers" INNER JOIN "subjects_teachers" ON "teachers"."id" = "subjects_teachers"."teacher_id" INNER JOIN "subjects" ON "subjects_teachers"."subject_id" = "subjects"."id" INNER JOIN "students_subjects" ON "subjects"."id" = "students_subjects"."subject_id" WHERE "students_subjects"."student_id" = $1  [["student_id", 11]]

  def update
    student = Student.find_by_id(params["id"])
    student.update_attributes(name: params["student"]["name"], roll_number: params["student"]["roll_number"], city: params["student"]["city"] )
    student.subjects = Subject.where(id: params["student"]["subject_ids"])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "students" SET "name" = $1, "roll_number" = $2, "city" = $3, "updated_at" = $4 WHERE "students"."id" = $5  [["name", "Tom"], ["roll_number", 223], ["city", "Delhi"], ["updated_at", "2019-06-03 06:03:18.662433"], ["id", 11]]
SELECT "subjects".* FROM "subjects" INNER JOIN "students_subjects" ON "subjects"."id" = "students_subjects"."subject_id" WHERE "students_subjects"."student_id" = $1  [["student_id", 12]]

  def destroy
    student = Student.find_by_id(params["id"])
    flash[:notice] = "Student: '#{student.name}' deleted permanently."
    student.destroy
---
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = $1  [["id", 17]]