app/controllers/subjects_controller.rb

  def create
    subject = Subject.new(subject_params)
    subject.save
---
INSERT INTO "subjects" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Geography"], ["description", "boring"], ["created_at", "2019-06-01 07:11:59.875962"], ["updated_at", "2019-06-01 07:11:59.875962"]]