app/controllers/teachers_controller.rb

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" IN (NULL, 3) LIMIT $1  [["LIMIT", 1]]
INSERT INTO "teachers" ("name", "education", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Ram"], ["education", "Masters"], ["created_at", "2019-06-01 07:04:44.968099"], ["updated_at", "2019-06-01 07:04:44.968099"]]
---
  def create
    @teacher = Teacher.new(teacher_params)
    @teacher.subjects = Subject.where(id: unsafe_params["teacher"]["subject_ids"])
    @teacher.save

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @teacher = Teacher.find_by_id(params["id"])

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "teachers" WHERE "teachers"."id" = $1  [["id", 6]]
---
  def destroy
    @teacher = Teacher.find_by_id(params["id"])
    flash[:notice] = "Teacher '#{@teacher.name}' deleted permanently."
    @teacher.destroy

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students" INNER JOIN "students_subjects" ON "students"."id" = "students_subjects"."student_id" INNER JOIN "subjects" ON "students_subjects"."subject_id" = "subjects"."id" INNER JOIN "subjects_teachers" ON "subjects"."id" = "subjects_teachers"."subject_id" WHERE "subjects_teachers"."teacher_id" = $1  [["teacher_id", 1]]
---
  def students_details
    @students_details = Teacher.find_by_id(params["id"]).students